tutorial/CounterFlowFlame2D/CH4_1step/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver            ode;
    //solver            OptRodas34;
    //method            FastChemistryModel;
}

chemistry           on;

initialChemicalTimeStep 1e-07;

EulerImplicitCoeffs
{
    cTauChem        1;
}
odeCoeffs
{
    solver          rodas34;
    absTol          1e-8;
    relTol          1e-4;

}
OptRodas34Coeffs
{
    solver          Rosenbrock43;
    absTol          1e-8;
    relTol          1e-4;
}

#include "reactions"

// ************************************************************************* //
